#+OPTIONS: LaTeX:t

***** Fixed Costs

Depreciation, interest, insurance and taxes are all considered fixed
costs as they do not vary with the amount that the machine is
used. We asked vendors to select between three methods used to
calculate depreciation: '/strait line/' assumes constant annual
depreciation over the life span of the equipment, '/declining balance/'
weights depreciation toward the early years of the equipments economic
life, and '/sum-of-years-digits/' which is an alternate way of
weighting depreciation toward the earlier years. See Miyata for a more
detailed discussion of the different methods of estimating
depreciation. We estimate interest insurance and taxes on the basis of
the Average Value of Yearly Investment (AVI). AVI is calculated as
follows:

\begin{equation}
     \text{AVI}=\frac{(P-S)(N+1)}{2N}+S
\end{equation}
Where:
$P$ = Initial Investment \\
$S$ = Salvage Value \\
$N$ = Economic Life \\

We estimate interest, insurance and taxes as 12%, 3% and 3% of AVI
respectively based on Miyata.

#+NAME:   tab:equip_fixed
 #+BEGIN_SRC sqlite :db hfrd_machinecost.db  :colnames yes :exports results
 select mfg||'--'||model "Equipment", '$'||printf("%.2f", av_ann_dep) "D", dep_method "Dep. Method", '$'||printf("%.1f", avi) "AVI", '$'||printf("%.1f", interest ) "Interest", '$'||printf("%.1f",insurance) "Insurance", '$'||printf("%.1f", taxes) "Taxes" from fixed;
 #+END_SRC

 #+RESULTS: tab:equip_fixed
 | Equipment                            | D         | Dep. Method       | AVI       | Interest | Insurance | Taxes   |
 |--------------------------------------+-----------+-------------------+-----------+----------+-----------+---------|
 | Fecon--FTX128                        | $16000.00 | nan               | $128000.0 | $15360.0 | $3840.0   | $3840.0 |
 | Kaiser--S2-2                         | $29920.00 | nan               | $239360.0 | $28723.2 | $7180.8   | $7180.8 |
 | FAE - Prime Tech--PT-175             | $27200.00 | nan               | $166600.0 | $19992.0 | $4998.0   | $4998.0 |
 | Takeuchi--TL12CRH                    | $11805.60 | strait line       | $76736.4  | $9208.4  | $2302.1   | $2302.1 |
 | Caterpillar--299D XHP                | $25102.34 | declining balance | $98520.0  | $11822.4 | $2955.6   | $2955.6 |
 | Takeuchi--TB290CL                    | $13794.90 | strait line       | $89666.9  | $10760.0 | $2690.0   | $2690.0 |
 | John Deere/Fecon--JD210 with BH80EXC | $10800.00 | strait line       | $167400.0 | $20088.0 | $5022.0   | $5022.0 |
 | 2000 Timbco Feller Buncher--425D     | $40400.00 | strait line       | $323200.0 | $38784.0 | $9696.0   | $9696.0 |

#+CAPTION:Fxed costs. D: Average annual depreciation over the lifespan of the equipment, AVI: Average Value of Yearly Investment.

***** Total Hourly Costs

Total costs per Productive Machine Hour ($/PMH) were then calculated
for each piece of equipment.
#+NAME:   tab:equip_pmh
 #+BEGIN_SRC sqlite :db hfrd_machinecost.db  :colnames yes :exports results
 select mfg||'--'||model "Equipment", '$'||printf('%.1f',pmh) "$/PMH" from prelim;
 #+END_SRC

 #+RESULTS: tab:equip_pmh
 | Equipment                            | $/PMH |
 |--------------------------------------+-------|
 | Fecon--FTX128                        | $56.5 |
 | Kaiser--S2-2                         | $87.3 |
 | FAE - Prime Tech--PT-175             | $74.7 |
 | Takeuchi--TL12CRH                    | $43.2 |
 | Caterpillar--299D XHP                | $57.3 |
 | Takeuchi--TB290CL                    | $42.8 |
 | John Deere/Fecon--JD210 with BH80EXC | $56.8 |
 | 2000 Timbco Feller Buncher--425D     | $99.5 |
 


#+NAME: equippmh_old
| Equipment                            | $/PMH  | old (wrong) |
|--------------------------------------+--------+-------------|
| Fecon--FTX128                        | $73.3  |        56.5 |
| Kaiser--S2-2                         | $120.3 |        87.3 |
| FAE - Prime Tech--PT-175             | $76.3  |        74.7 |
| Takeuchi--TL12CRH                    | $43.5  |        43.2 |
| Caterpillar--299D XHP                | $57.3  |        57.3 |
| Takeuchi--TB290CL                    | $42.7  |        42.8 |
| John Deere/Fecon--JD210 with BH80EXC | $56.2  |        56.8 |
| 2000 Timbco Feller Buncher--425D     | $100.3 |        99.5 |


